MarekRyn/MiniConsoleV3_Firmware/CM7/Startup/startup_stm32h747bgtx.s
/*******************************************************************************
* MiniConsole V3 - Vector table for applications (starts at 0x08000400)
*******************************************************************************/

// Placeholder for future use
 .word		0								/* 0000 */
 .word		0								/* 0001 */
 .word		0								/* 0002 */
 .word		0								/* 0003 */
 .word		0								/* 0004 */
 .word		0								/* 0005 */
 .word		0								/* 0006 */
 .word		0								/* 0007 */

// BSP Structures
 .word		BSP_hlcdtp						/* 0008 */
 .word		BSP_himu						/* 0009 */
 .word		BSP_hinputs						/* 0010 */
 .word		0								/* 0011 */
 .word		0								/* 0012 */
 .word		0								/* 0013 */
 .word		0								/* 0014 */
 .word		0								/* 0015 */

// System functions
 .word		BSP_PWR_Restart					/* 0016 */
 .word		BSP_PWR_ShutDown				/* 0017 */
 .word		BSP_Delay						/* 0018 */
 .word		BSP_GetTick						/* 0019 */
 .word		BSP_SetHomeDir					/* 0020 */
 .word		BSP_RTC_GetDate					/* 0021 */
 .word		BSP_RTC_GetTime					/* 0022 */
 .word		BSP_RTC_GetUnixTimestamp		/* 0023 */
 .word		0								/* 0024 */
 .word		0								/* 0025 */
 .word		0								/* 0026 */
 .word		0								/* 0027 */
 .word		0								/* 0028 */
 .word		0								/* 0029 */
 .word		0								/* 0030 */
 .word		BSP_Serial_Transmit				/* 0031 */

// LCD and Touch Panel Library
 .word		BSP_LCD_Init					/* 0032 */
 .word		BSP_LCD_FrameReady				/* 0033 */
 .word		BSP_LCD_GetEditPermission		/* 0034 */
 .word		BSP_LCD_SetBackLight			/* 0035 */
 .word		BSP_LCD_GetBackLight			/* 0036 */
 .word		BSP_LCD_BacklLightOff			/* 0037 */
 .word		BSP_LCD_BackLightOn				/* 0038 */
 .word		BSP_LCD_GetFrameTime			/* 0039 */
 .word		BSP_LCD_UpdateCLUT				/* 0040 */
 .word		BSP_LCD_GetEditFrameAddr		/* 0041 */
 .word		BSP_LCD_SetDisplayWindow		/* 0042 */
 .word		0								/* 0043 */
 .word		0								/* 0044 */
 .word		0								/* 0045 */
 .word		0								/* 0046 */
 .word		0								/* 0047 */
 .word		0								/* 0048 */
 .word		0								/* 0049 */
 .word		0								/* 0050 */
 .word		0								/* 0051 */
 .word		0								/* 0052 */
 .word		0								/* 0053 */
 .word		0								/* 0054 */
 .word		0								/* 0055 */
 .word		0								/* 0056 */
 .word		0								/* 0057 */
 .word		0								/* 0058 */
 .word		0								/* 0059 */
 .word		0								/* 0060 */
 .word		0								/* 0061 */
 .word		0								/* 0062 */
 .word		0								/* 0063 */
 .word		BSP_LCD_TP_RegisterArea			/* 0064 */
 .word		BSP_LCD_TP_RemoveArea			/* 0065 */
 .word		BSP_LCD_TP_RemoveAreaRange		/* 0066 */
 .word		BSP_LCD_TP_RemoveAllAreas		/* 0067 */
 .word		BSP_LCD_TP_Enable				/* 0068 */
 .word		BSP_LCD_TP_Disable				/* 0069 */
 .word		0								/* 0070 */
 .word		0								/* 0071 */
 .word		0								/* 0072 */
 .word		0								/* 0073 */
 .word		0								/* 0074 */
 .word		0								/* 0075 */
 .word		0								/* 0076 */
 .word		0								/* 0077 */
 .word		0								/* 0078 */
 .word		0								/* 0079 */
 .word		0								/* 0080 */
 .word		0								/* 0081 */
 .word		0								/* 0082 */
 .word		0								/* 0083 */
 .word		0								/* 0084 */
 .word		0								/* 0085 */
 .word		0								/* 0086 */
 .word		0								/* 0087 */
 .word		0								/* 0088 */
 .word		0								/* 0089 */
 .word		0								/* 0090 */
 .word		0								/* 0091 */
 .word		0								/* 0092 */
 .word		0								/* 0093 */
 .word		0								/* 0094 */
 .word		0								/* 0095 */

 // Video Library
 .word		BSP_Video_Init					/* 0096 */
 .word		BSP_Video_GetFrame				/* 0097 */
 .word		BSP_Video_DeInit				/* 0098 */
 .word		BSP_Video_Seek					/* 0099 */
 .word		BSP_Video_Rev					/* 0100 */
 .word		BSP_Video_Fwd					/* 0101 */
 .word		BSP_Video_Play					/* 0102 */
 .word		BSP_Video_Stop					/* 0103 */
 .word		BSP_Video_Pause					/* 0104 */
 .word		BSP_Video_SetVolume				/* 0105 */
 .word		BSP_Video_DrawFrame				/* 0106 */
 .word		BSP_Video_DrawFrameC			/* 0107 */
 .word		BSP_Video_GetTotalFrames		/* 0108 */
 .word		BSP_Video_GetCurrentFrame		/* 0109 */
 .word		BSP_Video_GetWidth				/* 0110 */
 .word		BSP_Video_GetHeight				/* 0111 */
 .word		BSP_Video_GetFrameRate			/* 0112 */
 .word		0								/* 0113 */
 .word		0								/* 0114 */
 .word		0								/* 0115 */
 .word		0								/* 0116 */
 .word		0								/* 0117 */
 .word		0								/* 0118 */
 .word		0								/* 0119 */
 .word		0								/* 0120 */
 .word		0								/* 0121 */
 .word		0								/* 0122 */
 .word		0								/* 0123 */
 .word		0								/* 0124 */
 .word		0								/* 0125 */
 .word		0								/* 0126 */
 .word		0								/* 0127 */

// G2D Library
 .word		G2D_ClearFrame					/* 0128 */
 .word		G2D_FillFrame					/* 0129 */
 .word		G2D_CopyPrevFrame				/* 0130 */
 .word		G2D_CopyScrollPrevFrame			/* 0131 */
 .word		G2D_DrawPixel					/* 0132 */
 .word		G2D_DrawHLine					/* 0133 */
 .word		G2D_DrawHLineBlend				/* 0134 */
 .word		G2D_DrawVLine					/* 0135 */
 .word		G2D_DrawVLineBlend				/* 0136 */
 .word		G2D_DrawLine					/* 0137 */
 .word		G2D_DrawRect					/* 0138 */
 .word		G2D_DrawFillRect				/* 0139 */
 .word		G2D_DrawFillRectBlend			/* 0140 */
 .word		G2D_DrawCircle					/* 0141 */
 .word		G2D_DrawFillCircle				/* 0142 */
 .word		G2D_DrawFillCircleBlend			/* 0143 */
 .word		G2D_DrawRoundRect				/* 0144 */
 .word		G2D_DrawFillRoundRect			/* 0145 */
 .word		G2D_DrawFillRoundRectBlend		/* 0146 */
 .word		G2D_Text						/* 0147 */
 .word		G2D_TextBlend					/* 0148 */
 .word		G2D_GetTextHeight				/* 0149 */
 .word		G2D_DrawBitmapBlend				/* 0150 */
 .word		G2D_DrawBitmapBlendC			/* 0151 */
 .word		G2D_DrawBitmap					/* 0152 */
 .word		G2D_DrawBitmapC					/* 0153 */
 .word		G2D_DrawBitmapRotate			/* 0154 */
 .word		G2D_DrawBitmapRotateC			/* 0155 */
 .word		G2D_DrawIcon					/* 0156 */
 .word		G2D_DrawIconC					/* 0157 */
 .word		G2D_DrawIconBlend				/* 0158 */
 .word		G2D_DrawIconBlendC				/* 0159 */
 .word		G2D_GetIconHeight				/* 0160 */
 .word		G2D_GetIconWidth				/* 0161 */
 .word		G2D_DrawJPEG					/* 0162 */
 .word		G2D_DrawJPEGC					/* 0163 */
 .word		G2D_DrawLastJPEG				/* 0164 */
 .word		G2D_DrawLastJPEGC				/* 0165 */
 .word		G2D_DecodeJPEG					/* 0166 */
 .word		0								/* 0167 */
 .word		0								/* 0168 */
 .word		0								/* 0169 */
 .word		0								/* 0170 */
 .word		G2D_Color						/* 0171 */
 .word		G2D_Alpha						/* 0172 */
 .word		G2D_CopyBuf						/* 0173 */
 .word		G2D_CopyBufBlend				/* 0174 */
 .word		G2D_CacheFrame					/* 0175 */
 .word		G2D_RestoreFrame				/* 0176 */
 .word		0								/* 0177 */
 .word		0								/* 0178 */
 .word		0								/* 0179 */
 .word		0								/* 0180 */
 .word		0								/* 0181 */
 .word		0								/* 0182 */
 .word		0								/* 0183 */
 .word		0								/* 0184 */
 .word		0								/* 0185 */
 .word		0								/* 0186 */
 .word		0								/* 0187 */
 .word		0								/* 0188 */
 .word		0								/* 0189 */
 .word		0								/* 0190 */
 .word		0								/* 0191 */
 .word		0								/* 0192 */
 .word		0								/* 0193 */
 .word		0								/* 0194 */
 .word		0								/* 0195 */
 .word		0								/* 0196 */
 .word		0								/* 0197 */
 .word		0								/* 0198 */
 .word		0								/* 0199 */
 .word		0								/* 0200 */
 .word		0								/* 0201 */
 .word		0								/* 0202 */
 .word		0								/* 0203 */
 .word		0								/* 0204 */
 .word		0								/* 0205 */
 .word		0								/* 0206 */
 .word		0								/* 0207 */
 .word		0								/* 0208 */
 .word		0								/* 0209 */
 .word		0								/* 0210 */
 .word		0								/* 0211 */
 .word		0								/* 0212 */
 .word		0								/* 0213 */
 .word		0								/* 0214 */
 .word		0								/* 0215 */
 .word		0								/* 0216 */
 .word		0								/* 0217 */
 .word		0								/* 0218 */
 .word		0								/* 0219 */
 .word		0								/* 0220 */
 .word		0								/* 0221 */
 .word		0								/* 0222 */
 .word		0								/* 0223 */
 .word		0								/* 0224 */
 .word		0								/* 0225 */
 .word		0								/* 0226 */
 .word		0								/* 0227 */
 .word		0								/* 0228 */
 .word		0								/* 0229 */
 .word		0								/* 0230 */
 .word		0								/* 0231 */
 .word		0								/* 0232 */
 .word		0								/* 0233 */
 .word		0								/* 0234 */
 .word		0								/* 0235 */
 .word		0								/* 0236 */
 .word		0								/* 0237 */
 .word		0								/* 0238 */
 .word		0								/* 0239 */
 .word		0								/* 0240 */
 .word		0								/* 0241 */
 .word		0								/* 0242 */
 .word		0								/* 0243 */
 .word		0								/* 0244 */
 .word		0								/* 0245 */
 .word		0								/* 0246 */
 .word		0								/* 0247 */
 .word		0								/* 0248 */
 .word		0								/* 0249 */
 .word		0								/* 0250 */
 .word		0								/* 0251 */
 .word		0								/* 0252 */
 .word		0								/* 0253 */
 .word		0								/* 0254 */
 .word		0								/* 0255 */

// Audio Library
 .word		BSP_Audio_SetMasterVolume		/* 0256 */
 .word		BSP_Audio_GetMasterVolume		/* 0257 */
 .word		BSP_Audio_GetMasterVolumeL		/* 0258 */
 .word		BSP_Audio_GetMasterVolumeR		/* 0259 */
 .word		BSP_Audio_SetMasterVolumeLR		/* 0260 */
 .word		BSP_Audio_IncMasterVolume		/* 0261 */
 .word		BSP_Audio_DecMasterVolume		/* 0262 */
 .word		BSP_Audio_SetChannelVolume		/* 0263 */
 .word		BSP_Audio_SetChannelVolumeLR	/* 0264 */
 .word		BSP_Audio_IncChannelVolume		/* 0265 */
 .word		BSP_Audio_DecChannelVolume		/* 0266 */
 .word		BSP_Audio_LinkSourceMID			/* 0267 */
 .word		BSP_Audio_LinkSourceMP3			/* 0268 */
 .word		BSP_Audio_LinkSourceMOD			/* 0269 */
 .word		BSP_Audio_LinkSourceRAW			/* 0270 */
 .word		BSP_Audio_ChannelPLay			/* 0271 */
 .word		BSP_Audio_ChannelStop			/* 0272 */
 .word		BSP_Audio_ChannelPause			/* 0273 */
 .word		BSP_Audio_RegisterStatusCallback/* 0274 */
 .word		BSP_Audio_GetStatusParam		/* 0275 */
 .word		BSP_Audio_GetFreeChannel		/* 0276 */
 .word		0								/* 0277 */
 .word		0								/* 0278 */
 .word		0								/* 0279 */
 .word		0								/* 0280 */
 .word		0								/* 0281 */
 .word		0								/* 0282 */
 .word		0								/* 0283 */
 .word		0								/* 0284 */
 .word		0								/* 0285 */
 .word		0								/* 0286 */
 .word		0								/* 0287 */
 .word		0								/* 0288 */
 .word		0								/* 0289 */
 .word		0								/* 0290 */
 .word		0								/* 0291 */
 .word		0								/* 0292 */
 .word		0								/* 0293 */
 .word		0								/* 0294 */
 .word		0								/* 0295 */
 .word		0								/* 0296 */
 .word		0								/* 0297 */
 .word		0								/* 0298 */
 .word		0								/* 0299 */
 .word		0								/* 0300 */
 .word		0								/* 0301 */
 .word		0								/* 0302 */
 .word		0								/* 0303 */
 .word		0								/* 0304 */
 .word		0								/* 0305 */
 .word		0								/* 0306 */
 .word		0								/* 0307 */
 .word		0								/* 0308 */
 .word		0								/* 0309 */
 .word		0								/* 0310 */
 .word		0								/* 0311 */
 .word		0								/* 0312 */
 .word		0								/* 0313 */
 .word		0								/* 0314 */
 .word		0								/* 0315 */
 .word		0								/* 0316 */
 .word		0								/* 0317 */
 .word		0								/* 0318 */
 .word		0								/* 0319 */
 .word		0								/* 0320 */
 .word		0								/* 0321 */
 .word		0								/* 0322 */
 .word		0								/* 0323 */
 .word		0								/* 0324 */
 .word		0								/* 0325 */
 .word		0								/* 0326 */
 .word		0								/* 0327 */
 .word		0								/* 0328 */
 .word		0								/* 0329 */
 .word		0								/* 0330 */
 .word		0								/* 0331 */
 .word		0								/* 0332 */
 .word		0								/* 0333 */
 .word		0								/* 0334 */
 .word		0								/* 0335 */
 .word		0								/* 0336 */
 .word		0								/* 0337 */
 .word		0								/* 0338 */
 .word		0								/* 0339 */
 .word		0								/* 0340 */
 .word		0								/* 0341 */
 .word		0								/* 0342 */
 .word		0								/* 0343 */
 .word		0								/* 0344 */
 .word		0								/* 0345 */
 .word		0								/* 0346 */
 .word		0								/* 0347 */
 .word		0								/* 0348 */
 .word		0								/* 0349 */
 .word		0								/* 0350 */
 .word		0								/* 0351 */
 .word		0								/* 0352 */
 .word		0								/* 0353 */
 .word		0								/* 0354 */
 .word		0								/* 0355 */
 .word		0								/* 0356 */
 .word		0								/* 0357 */
 .word		0								/* 0358 */
 .word		0								/* 0359 */
 .word		0								/* 0360 */
 .word		0								/* 0361 */
 .word		0								/* 0362 */
 .word		0								/* 0363 */
 .word		0								/* 0364 */
 .word		0								/* 0365 */
 .word		0								/* 0366 */
 .word		0								/* 0367 */
 .word		0								/* 0368 */
 .word		0								/* 0369 */
 .word		0								/* 0370 */
 .word		0								/* 0371 */
 .word		0								/* 0372 */
 .word		0								/* 0373 */
 .word		0								/* 0374 */
 .word		0								/* 0375 */
 .word		0								/* 0376 */
 .word		0								/* 0377 */
 .word		0								/* 0378 */
 .word		0								/* 0379 */
 .word		0								/* 0380 */
 .word		0								/* 0381 */
 .word		0								/* 0382 */
 .word		0								/* 0383 */

