MarekRyn/MiniConsoleV3_Firmware/CM7/Startup/startup_stm32h747bgtx.s
// Resources
 .word		BSP_Res_Init					/* 0384 */
 .word		BSP_Res_Alloc					/* 0385 */
 .word		BSP_Res_Free					/* 0386 */
 .word		BSP_Res_Load					/* 0387 */
 .word		BSP_Res_GetSize					/* 0388 */
 .word		0								/* 0389 */
 .word		0								/* 0390 */
 .word		0								/* 0391 */
 .word		0								/* 0392 */
 .word		0								/* 0393 */
 .word		0								/* 0394 */
 .word		0								/* 0395 */
 .word		0								/* 0396 */
 .word		0								/* 0397 */
 .word		0								/* 0398 */
 .word		0								/* 0399 */
 .word		0								/* 0400 */
 .word		0								/* 0401 */
 .word		0								/* 0402 */
 .word		0								/* 0403 */
 .word		0								/* 0404 */
 .word		0								/* 0405 */
 .word		0								/* 0406 */
 .word		0								/* 0407 */
 .word		0								/* 0408 */
 .word		0								/* 0409 */
 .word		0								/* 0410 */
 .word		0								/* 0411 */
 .word		0								/* 0412 */
 .word		0								/* 0413 */
 .word		0								/* 0414 */
 .word		0								/* 0415 */
 .word		0								/* 0416 */
 .word		0								/* 0417 */
 .word		0								/* 0418 */
 .word		0								/* 0419 */
 .word		0								/* 0420 */
 .word		0								/* 0421 */
 .word		0								/* 0422 */
 .word		0								/* 0423 */
 .word		0								/* 0424 */
 .word		0								/* 0425 */
 .word		0								/* 0426 */
 .word		0								/* 0427 */
 .word		0								/* 0428 */
 .word		0								/* 0429 */
 .word		0								/* 0430 */
 .word		0								/* 0431 */
 .word		0								/* 0432 */
 .word		0								/* 0433 */
 .word		0								/* 0434 */
 .word		0								/* 0435 */
 .word		0								/* 0436 */
 .word		0								/* 0437 */
 .word		0								/* 0438 */
 .word		0								/* 0439 */
 .word		0								/* 0440 */
 .word		0								/* 0441 */
 .word		0								/* 0442 */
 .word		0								/* 0443 */
 .word		0								/* 0444 */
 .word		0								/* 0445 */
 .word		0								/* 0446 */
 .word		0								/* 0447 */

 // FATFS
 .word		f_open							/* 0448 */
 .word		f_close							/* 0449 */
 .word		f_read							/* 0450 */
 .word		f_write							/* 0451 */
 .word		f_lseek							/* 0452 */
 .word		f_truncate						/* 0453 */
 .word		f_sync							/* 0454 */
 .word		f_opendir						/* 0455 */
 .word		f_closedir						/* 0456 */
 .word		f_readdir						/* 0457 */
 .word		0								/* 0458 */
 .word		0								/* 0459 */
 .word		f_mkdir							/* 0460 */
 .word		f_unlink						/* 0461 */
 .word		f_rename						/* 0462 */
 .word		f_stat							/* 0463 */
 .word		0								/* 0464 */
 .word		0								/* 0465 */
 .word		0		 						/* 0466 */
 .word		0								/* 0467 */
 .word		0								/* 0468 */
 .word		0								/* 0469 */
 .word		f_getfree						/* 0470 */
 .word		f_getlabel						/* 0471 */
 .word		0								/* 0472 */
 .word		0								/* 0473 */
 .word		0								/* 0474 */
 .word		0								/* 0475 */
 .word		0								/* 0476 */
 .word		0								/* 0477 */
 .word		0								/* 0478 */
 .word		f_putc							/* 0479 */
 .word		f_puts							/* 0480 */
 .word		f_printf						/* 0481 */
 .word		f_gets							/* 0482 */
 .word		0								/* 0483 */
 .word		0								/* 0484 */
 .word		0								/* 0485 */
 .word		0								/* 0486 */
 .word		0								/* 0487 */
 .word		0								/* 0488 */
 .word		0								/* 0489 */
 .word		0								/* 0490 */
 .word		0								/* 0491 */
 .word		0								/* 0492 */
 .word		0								/* 0493 */
 .word		0								/* 0494 */
 .word		0								/* 0495 */
 .word		0								/* 0496 */
 .word		0								/* 0497 */
 .word		0								/* 0498 */
 .word		0								/* 0499 */
 .word		0								/* 0500 */
 .word		0								/* 0501 */
 .word		0								/* 0502 */
 .word		0								/* 0503 */
 .word		0								/* 0504 */
 .word		0								/* 0505 */
 .word		0								/* 0506 */
 .word		0								/* 0507 */
 .word		0								/* 0508 */
 .word		0								/* 0509 */
 .word		0								/* 0510 */
 .word		0								/* 0511 */

// USB Stack
 .word		BSP_USB_MSC_Init				/* 0512 */
 .word		BSP_USB_CDC_Init				/* 0513 */
 .word		BSP_USB_HID_Init				/* 0514 */
 .word		0								/* 0515 */
 .word		0								/* 0516 */
 .word		0								/* 0517 */
 .word		0								/* 0518 */
 .word		0								/* 0519 */
 .word		BSP_USB_Disconnect				/* 0520 */
 .word		BSP_USB_Task					/* 0521 */
 .word		BSP_USB_IsConnected				/* 0522 */
 .word		0								/* 0523 */
 .word		0								/* 0524 */
 .word		0								/* 0525 */
 .word		0								/* 0526 */
 .word		0								/* 0527 */
 .word		BSP_USB_CDC_RegCbRx				/* 0528 */
 .word		BSP_USB_CDC_RegCbRxChar			/* 0529 */
 .word		BSP_USB_CDC_RegCbTx				/* 0530 */
 .word		BSP_USB_CDC_DataAvailable		/* 0531 */
 .word		BSP_USB_CDC_Read				/* 0532 */
 .word		BSP_USB_CDC_Write				/* 0533 */
 .word		BSP_USB_CDC_WriteFlush			/* 0534 */
 .word		BSP_USB_CDC_ReadFlush			/* 0535 */
 .word		0								/* 0536 */
 .word		0								/* 0537 */
 .word		0								/* 0538 */
 .word		0								/* 0539 */
 .word		0								/* 0540 */
 .word		0								/* 0541 */
 .word		0								/* 0542 */
 .word		0								/* 0543 */
 .word		BSP_USB_HID_RegCbLeds			/* 0544 */
 .word		BSP_USB_HID_Mouse				/* 0545 */
 .word		BSP_USB_HID_Keyboard			/* 0546 */
 .word		BSP_USB_HID_Gamepad				/* 0547 */
 .word		BSP_USB_HID_Ctrl				/* 0548 */
 .word		0								/* 0549 */
 .word		0								/* 0550 */
 .word		0								/* 0551 */
 .word		0								/* 0552 */
 .word		0								/* 0553 */
 .word		0								/* 0554 */
 .word		0								/* 0555 */
 .word		0								/* 0556 */
 .word		0								/* 0557 */
 .word		0								/* 0558 */
 .word		0								/* 0559 */
 .word		0								/* 0560 */
 .word		0								/* 0561 */
 .word		0								/* 0562 */
 .word		0								/* 0563 */
 .word		0								/* 0564 */
 .word		0								/* 0565 */
 .word		0								/* 0566 */
 .word		0								/* 0567 */
 .word		0								/* 0568 */
 .word		0								/* 0569 */
 .word		0								/* 0570 */
 .word		0								/* 0571 */
 .word		0								/* 0572 */
 .word		0								/* 0573 */
 .word		0								/* 0574 */
 .word		0								/* 0575 */
 .word		0								/* 0576 */
 .word		0								/* 0577 */
 .word		0								/* 0578 */
 .word		0								/* 0579 */
 .word		0								/* 0580 */
 .word		0								/* 0581 */
 .word		0								/* 0582 */
 .word		0								/* 0583 */
 .word		0								/* 0584 */
 .word		0								/* 0585 */
 .word		0								/* 0586 */
 .word		0								/* 0587 */
 .word		0								/* 0588 */
 .word		0								/* 0589 */
 .word		0								/* 0590 */
 .word		0								/* 0591 */
 .word		0								/* 0592 */
 .word		0								/* 0593 */
 .word		0								/* 0594 */
 .word		0								/* 0595 */
 .word		0								/* 0596 */
 .word		0								/* 0597 */
 .word		0								/* 0598 */
 .word		0								/* 0599 */
 .word		0								/* 0600 */
 .word		0								/* 0601 */
 .word		0								/* 0602 */
 .word		0								/* 0603 */
 .word		0								/* 0604 */
 .word		0								/* 0605 */
 .word		0								/* 0606 */
 .word		0								/* 0607 */
 .word		0								/* 0608 */
 .word		0								/* 0609 */
 .word		0								/* 0610 */
 .word		0								/* 0611 */
 .word		0								/* 0612 */
 .word		0								/* 0613 */
 .word		0								/* 0614 */
 .word		0								/* 0615 */
 .word		0								/* 0616 */
 .word		0								/* 0617 */
 .word		0								/* 0618 */
 .word		0								/* 0619 */
 .word		0								/* 0620 */
 .word		0								/* 0621 */
 .word		0								/* 0622 */
 .word		0								/* 0623 */
 .word		0								/* 0624 */
 .word		0								/* 0625 */
 .word		0								/* 0626 */
 .word		0								/* 0627 */
 .word		0								/* 0628 */
 .word		0								/* 0629 */
 .word		0								/* 0630 */
 .word		0								/* 0631 */
 .word		0								/* 0632 */
 .word		0								/* 0633 */
 .word		0								/* 0634 */
 .word		0								/* 0635 */
 .word		0								/* 0636 */
 .word		0								/* 0637 */
 .word		0								/* 0638 */
 .word		0								/* 0639 */

