MarekRyn/MiniConsoleV3_Firmware/CM7/Startup/startup_stm32h747bgtx.s
// Remaining set as NULL
 .word		0								/* 0640 */
 .word		0								/* 0641 */
 .word		0								/* 0642 */
 .word		0								/* 0643 */
 .word		0								/* 0644 */
 .word		0								/* 0645 */
 .word		0								/* 0646 */
 .word		0								/* 0647 */
 .word		0								/* 0648 */
 .word		0								/* 0649 */
 .word		0								/* 0650 */
 .word		0								/* 0651 */
 .word		0								/* 0652 */
 .word		0								/* 0653 */
 .word		0								/* 0654 */
 .word		0								/* 0655 */
 .word		0								/* 0656 */
 .word		0								/* 0657 */
 .word		0								/* 0658 */
 .word		0								/* 0659 */
 .word		0								/* 0660 */
 .word		0								/* 0661 */
 .word		0								/* 0662 */
 .word		0								/* 0663 */
 .word		0								/* 0664 */
 .word		0								/* 0665 */
 .word		0								/* 0666 */
 .word		0								/* 0667 */
 .word		0								/* 0668 */
 .word		0								/* 0669 */
 .word		0								/* 0670 */
 .word		0								/* 0671 */
 .word		0								/* 0672 */
 .word		0								/* 0673 */
 .word		0								/* 0674 */
 .word		0								/* 0675 */
 .word		0								/* 0676 */
 .word		0								/* 0677 */
 .word		0								/* 0678 */
 .word		0								/* 0679 */
 .word		0								/* 0680 */
 .word		0								/* 0681 */
 .word		0								/* 0682 */
 .word		0								/* 0683 */
 .word		0								/* 0684 */
 .word		0								/* 0685 */
 .word		0								/* 0686 */
 .word		0								/* 0687 */
 .word		0								/* 0688 */
 .word		0								/* 0689 */
 .word		0								/* 0690 */
 .word		0								/* 0691 */
 .word		0								/* 0692 */
 .word		0								/* 0693 */
 .word		0								/* 0694 */
 .word		0								/* 0695 */
 .word		0								/* 0696 */
 .word		0								/* 0697 */
 .word		0								/* 0698 */
 .word		0								/* 0699 */
 .word		0								/* 0700 */
 .word		0								/* 0701 */
 .word		0								/* 0702 */
 .word		0								/* 0703 */
 .word		0								/* 0704 */
 .word		0								/* 0705 */
 .word		0								/* 0706 */
 .word		0								/* 0707 */
 .word		0								/* 0708 */
 .word		0								/* 0709 */
 .word		0								/* 0710 */
 .word		0								/* 0711 */
 .word		0								/* 0712 */
 .word		0								/* 0713 */
 .word		0								/* 0714 */
 .word		0								/* 0715 */
 .word		0								/* 0716 */
 .word		0								/* 0717 */
 .word		0								/* 0718 */
 .word		0								/* 0719 */
 .word		0								/* 0720 */
 .word		0								/* 0721 */
 .word		0								/* 0722 */
 .word		0								/* 0723 */
 .word		0								/* 0724 */
 .word		0								/* 0725 */
 .word		0								/* 0726 */
 .word		0								/* 0727 */
 .word		0								/* 0728 */
 .word		0								/* 0729 */
 .word		0								/* 0730 */
 .word		0								/* 0731 */
 .word		0								/* 0732 */
 .word		0								/* 0733 */
 .word		0								/* 0734 */
 .word		0								/* 0735 */
 .word		0								/* 0736 */
 .word		0								/* 0737 */
 .word		0								/* 0738 */
 .word		0								/* 0739 */
 .word		0								/* 0740 */
 .word		0								/* 0741 */
 .word		0								/* 0742 */
 .word		0								/* 0743 */
 .word		0								/* 0744 */
 .word		0								/* 0745 */
 .word		0								/* 0746 */
 .word		0								/* 0747 */
 .word		0								/* 0748 */
 .word		0								/* 0749 */
 .word		0								/* 0750 */
 .word		0								/* 0751 */
 .word		0								/* 0752 */
 .word		0								/* 0753 */
 .word		0								/* 0754 */
 .word		0								/* 0755 */
 .word		0								/* 0756 */
 .word		0								/* 0757 */
 .word		0								/* 0758 */
 .word		0								/* 0759 */
 .word		0								/* 0760 */
 .word		0								/* 0761 */
 .word		0								/* 0762 */
 .word		0								/* 0763 */
 .word		0								/* 0764 */
 .word		0								/* 0765 */
 .word		0								/* 0766 */
 .word		0								/* 0767 */
 .word		0								/* 0768 */
 .word		0								/* 0769 */
 .word		0								/* 0770 */
 .word		0								/* 0771 */
 .word		0								/* 0772 */
 .word		0								/* 0773 */
 .word		0								/* 0774 */
 .word		0								/* 0775 */
 .word		0								/* 0776 */
 .word		0								/* 0777 */
 .word		0								/* 0778 */
 .word		0								/* 0779 */
 .word		0								/* 0780 */
 .word		0								/* 0781 */
 .word		0								/* 0782 */
 .word		0								/* 0783 */
 .word		0								/* 0784 */
 .word		0								/* 0785 */
 .word		0								/* 0786 */
 .word		0								/* 0787 */
 .word		0								/* 0788 */
 .word		0								/* 0789 */
 .word		0								/* 0790 */
 .word		0								/* 0791 */
 .word		0								/* 0792 */
 .word		0								/* 0793 */
 .word		0								/* 0794 */
 .word		0								/* 0795 */
 .word		0								/* 0796 */
 .word		0								/* 0797 */
 .word		0								/* 0798 */
 .word		0								/* 0799 */
 .word		0								/* 0800 */
 .word		0								/* 0801 */
 .word		0								/* 0802 */
 .word		0								/* 0803 */
 .word		0								/* 0804 */
 .word		0								/* 0805 */
 .word		0								/* 0806 */
 .word		0								/* 0807 */
 .word		0								/* 0808 */
 .word		0								/* 0809 */
 .word		0								/* 0810 */
 .word		0								/* 0811 */
 .word		0								/* 0812 */
 .word		0								/* 0813 */
 .word		0								/* 0814 */
 .word		0								/* 0815 */
 .word		0								/* 0816 */
 .word		0								/* 0817 */
 .word		0								/* 0818 */
 .word		0								/* 0819 */
 .word		0								/* 0820 */
 .word		0								/* 0821 */
 .word		0								/* 0822 */
 .word		0								/* 0823 */
 .word		0								/* 0824 */
 .word		0								/* 0825 */
 .word		0								/* 0826 */
 .word		0								/* 0827 */
 .word		0								/* 0828 */
 .word		0								/* 0829 */
 .word		0								/* 0830 */
 .word		0								/* 0831 */
 .word		0								/* 0832 */
 .word		0								/* 0833 */
 .word		0								/* 0834 */
 .word		0								/* 0835 */
 .word		0								/* 0836 */
 .word		0								/* 0837 */
 .word		0								/* 0838 */
 .word		0								/* 0839 */
 .word		0								/* 0840 */
 .word		0								/* 0841 */
 .word		0								/* 0842 */
 .word		0								/* 0843 */
 .word		0								/* 0844 */
 .word		0								/* 0845 */
 .word		0								/* 0846 */
 .word		0								/* 0847 */
 .word		0								/* 0848 */
 .word		0								/* 0849 */
 .word		0								/* 0850 */
 .word		0								/* 0851 */
 .word		0								/* 0852 */
 .word		0								/* 0853 */
 .word		0								/* 0854 */
 .word		0								/* 0855 */
 .word		0								/* 0856 */
 .word		0								/* 0857 */
 .word		0								/* 0858 */
 .word		0								/* 0859 */
 .word		0								/* 0860 */
 .word		0								/* 0861 */
 .word		0								/* 0862 */
 .word		0								/* 0863 */
 .word		0								/* 0864 */
 .word		0								/* 0865 */
 .word		0								/* 0866 */
 .word		0								/* 0867 */
 .word		0								/* 0868 */
 .word		0								/* 0869 */
 .word		0								/* 0870 */
 .word		0								/* 0871 */
 .word		0								/* 0872 */
 .word		0								/* 0873 */
 .word		0								/* 0874 */
 .word		0								/* 0875 */
 .word		0								/* 0876 */
 .word		0								/* 0877 */
 .word		0								/* 0878 */
 .word		0								/* 0879 */
 .word		0								/* 0880 */
 .word		0								/* 0881 */
 .word		0								/* 0882 */
 .word		0								/* 0883 */
 .word		0								/* 0884 */
 .word		0								/* 0885 */
 .word		0								/* 0886 */
 .word		0								/* 0887 */
 .word		0								/* 0888 */
 .word		0								/* 0889 */
 .word		0								/* 0890 */
 .word		0								/* 0891 */
 .word		0								/* 0892 */
 .word		0								/* 0893 */
 .word		0								/* 0894 */
 .word		0								/* 0895 */
 .word		0								/* 0896 */
 .word		0								/* 0897 */
 .word		0								/* 0898 */
 .word		0								/* 0899 */
 .word		0								/* 0900 */
 .word		0								/* 0901 */
 .word		0								/* 0902 */
 .word		0								/* 0903 */
 .word		0								/* 0904 */
 .word		0								/* 0905 */
 .word		0								/* 0906 */
 .word		0								/* 0907 */
 .word		0								/* 0908 */
 .word		0								/* 0909 */
 .word		0								/* 0910 */
 .word		0								/* 0911 */
 .word		0								/* 0912 */
 .word		0								/* 0913 */
 .word		0								/* 0914 */
 .word		0								/* 0915 */
 .word		0								/* 0916 */
 .word		0								/* 0917 */
 .word		0								/* 0918 */
 .word		0								/* 0919 */
 .word		0								/* 0920 */
 .word		0								/* 0921 */
 .word		0								/* 0922 */
 .word		0								/* 0923 */
 .word		0								/* 0924 */
 .word		0								/* 0925 */
 .word		0								/* 0926 */
 .word		0								/* 0927 */
 .word		0								/* 0928 */
 .word		0								/* 0929 */
 .word		0								/* 0930 */
 .word		0								/* 0931 */
 .word		0								/* 0932 */
 .word		0								/* 0933 */
 .word		0								/* 0934 */
 .word		0								/* 0935 */
 .word		0								/* 0936 */
 .word		0								/* 0937 */
 .word		0								/* 0938 */
 .word		0								/* 0939 */
 .word		0								/* 0940 */
 .word		0								/* 0941 */
 .word		0								/* 0942 */
 .word		0								/* 0943 */
 .word		0								/* 0944 */
 .word		0								/* 0945 */
 .word		0								/* 0946 */
 .word		0								/* 0947 */
 .word		0								/* 0948 */
 .word		0								/* 0949 */
 .word		0								/* 0950 */
 .word		0								/* 0951 */
 .word		0								/* 0952 */
 .word		0								/* 0953 */
 .word		0								/* 0954 */
 .word		0								/* 0955 */
 .word		0								/* 0956 */
 .word		0								/* 0957 */
 .word		0								/* 0958 */
 .word		0								/* 0959 */
 .word		0								/* 0960 */
 .word		0								/* 0961 */
 .word		0								/* 0962 */
 .word		0								/* 0963 */
 .word		0								/* 0964 */
 .word		0								/* 0965 */
 .word		0								/* 0966 */
 .word		0								/* 0967 */
 .word		0								/* 0968 */
 .word		0								/* 0969 */
 .word		0								/* 0970 */
 .word		0								/* 0971 */
 .word		0								/* 0972 */
 .word		0								/* 0973 */
 .word		0								/* 0974 */
 .word		0								/* 0975 */
 .word		0								/* 0976 */
 .word		0								/* 0977 */
 .word		0								/* 0978 */
 .word		0								/* 0979 */
 .word		0								/* 0980 */
 .word		0								/* 0981 */
 .word		0								/* 0982 */
 .word		0								/* 0983 */
 .word		0								/* 0984 */
 .word		0								/* 0985 */
 .word		0								/* 0986 */
 .word		0								/* 0987 */
 .word		0								/* 0988 */
 .word		0								/* 0989 */
 .word		0								/* 0990 */
 .word		0								/* 0991 */
 .word		0								/* 0992 */
 .word		0								/* 0993 */
 .word		0								/* 0994 */
 .word		0								/* 0995 */
 .word		0								/* 0996 */
 .word		0								/* 0997 */
 .word		0								/* 0998 */
 .word		0								/* 0999 */
 .word		0								/* 1000 */
 .word		0								/* 1001 */
 .word		0								/* 1002 */
 .word		0								/* 1003 */
 .word		0								/* 1004 */
 .word		0								/* 1005 */
 .word		0								/* 1006 */
 .word		0								/* 1007 */
 .word		0								/* 1008 */
 .word		0								/* 1009 */
 .word		0								/* 1010 */
 .word		0								/* 1011 */
 .word		0								/* 1012 */
 .word		0								/* 1013 */
 .word		0								/* 1014 */
 .word		0								/* 1015 */
 .word		0								/* 1016 */
 .word		0								/* 1017 */
 .word		0								/* 1018 */
 .word		0								/* 1019 */
 .word		0								/* 1020 */
 .word		0								/* 1021 */
 .word		0								/* 1022 */
 .word		0								/* 1023 */


